Ran Plan for project: `monolith-production` dir: `terraform/env/monolith-production` workspace: `default`

<details><summary>Show Output</summary>

```diff
About to run custom workflow assume-mono-prod-spoke init extra_args backend-config=...

module.tags.module.constants.data.ibotta_accounts.all: Reading...
module.tags.data.external.git_metadata: Reading...
module.tags.data.external.git_metadata: Read complete after 0s [id=-]
module.tags.module.constants.data.ibotta_accounts.all: Read complete after 0s
module.ecr.data.aws_iam_policy_document.ecr_resource_policy: Reading...
module.ecr.data.aws_iam_policy_document.ecr_resource_policy: Read complete after 0s [id=3027735554]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_lifecycle_policy.git_tagged_lifecycle[0] will be created
+ resource "aws_ecr_lifecycle_policy" "git_tagged_lifecycle" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "keep the last 30 images"
                      + rulePriority = 10
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "git",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep the last 10 test images"
                      + rulePriority = 20
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "test",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "passenger-datadog-monitor"
    }

  # module.ecr.aws_ecr_repository.service will be created
+ resource "aws_ecr_repository" "service" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "passenger-datadog-monitor"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "application"         = "passenger-datadog-monitor"
          + "data-classification" = "2"
          + "domain"              = "proof-of-concept"
          + "env"                 = "production"
          + "environment"         = "production"
          + "git-dir"             = "terraform/env/monolith-production"
          + "git-repo"            = "Ibotta/passenger-datadog-monitor"
          + "group"               = "shared"
          + "pi"                  = "no"
          + "service"             = "passenger-datadog-monitor"
          + "service-tier"        = "2"
          + "squad"               = "shared"
          + "subgroup"            = "shared"
          + "terraform-workspace" = "default"
          + "zone"                = "none"
          + "zone-id"             = "none"
        }
      + tags_all             = {
          + "application"         = "passenger-datadog-monitor"
          + "data-classification" = "2"
          + "domain"              = "proof-of-concept"
          + "env"                 = "production"
          + "environment"         = "production"
          + "git-dir"             = "terraform/env/monolith-production"
          + "git-repo"            = "Ibotta/passenger-datadog-monitor"
          + "group"               = "shared"
          + "pi"                  = "no"
          + "service"             = "passenger-datadog-monitor"
          + "service-tier"        = "2"
          + "squad"               = "shared"
          + "subgroup"            = "shared"
          + "terraform-workspace" = "default"
          + "zone"                = "none"
          + "zone-id"             = "none"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository_policy.service_policy will be created
+ resource "aws_ecr_repository_policy" "service_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:PrincipalOrgID" = "o-sl6hgdz6av"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Sid       = "AllowAccountsInOrganizationToRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "passenger-datadog-monitor"
    }

Plan: 3 to add, 0 to change, 0 to destroy.


=== Running tfdr-ai workflow ===
Environment check:
  PULL_NUM: 3
  BASE_REPO_OWNER: Ibotta
  BASE_REPO_NAME: passenger-datadog-monitor
  PROJECT_NAME: monolith-production
  WORKSPACE: default
  PLANFILE: /atlantis-data/repos/Ibotta/passenger-datadog-monitor/3/default/terraform/env/monolith-production/monolith-production-default.tfplan
=== GitHub Authentication ===
  SUCCESS: Using TFDR_GITHUB_TOKEN
=== Checking for tfdr-ai label ===
  API URL: https://api.github.com/repos/Ibotta/passenger-datadog-monitor/pulls/3
  HTTP Status: 200
  Current PR labels found:
    - 'enhancement'
  INFO: tfdr-ai label not found - skipping processing
=== tfdr-ai workflow complete (no label) ===
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p monolith-production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-microservices.ops.int.ibops.net/lock?id=Ibotta%252Fpassenger-datadog-monitor%252Fterraform%252Fenv%252Fmonolith-production%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p monolith-production
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```